---
kind: type
id: T:Autodesk.Revit.DB.ViewType
source: html/bf04dabc-05a3-baf0-3564-f96c0bde3400.htm
---
# Autodesk.Revit.DB.ViewType

An enumerated type listing available view types.

## Syntax (C#)
```csharp
public enum ViewType
```